[{"referencenumber":1,"company":"Joveo","category":"Recruitment","department":"Recruitment","title":"CLIENT SUCCESS MANAGER","description":"Joveo is driving the next-generation of recruitment tech solutions globally. As our Senior Client Success Manager, you'll be a vital member of the founding team for Joveo Europe, based in London. You'll be earning a competitive salary, and we encourage flexible and remote working. \n\n            As our Senior Customer Success Manager, you'll be responsible for managing multiple customers and serve as their primary Joveo contact and advisor. You'll be empowered to succeed in your client focussed role while working collaboratively with the Global Head of CS and MD for Joveo UK on our regional Client Success strategy. \n           \n            With previous experience as a Client Success Manager you'll thrive in a fast-paced environment and be passionate about using creativity to collaboratively solve problems: helping our awesome customers win!","city":"London","state":"London","country":"United Kingdom","url":"https://www.joveo.com/careers","date":"2019-11-24","text":null,"valid":true},{"referencenumber":2,"company":"Joveo","category":"Recruitment","department":"Recruitment","title":"CUSTOMER SUCCESS MANAGER","description":"With brilliant people and innovative AI/ML technologies, Joveo is driving the next-generation of recruitment tech solutions globally. As a Customer Success Manager, you will be a key member of our fast-growing Customer Success Team. You will be responsible for managing multiple customers and serve as their primary Joveo interface, advisor and advocate. The ideal candidate thrives in a fast-paced environment and is passionate about being a customer advocate and a trusted strategic advisor by constantly acquiring and upgrading the required skills and domain knowledge. You build strong and long-lasting relationships with your customers and your efforts will drive customer satisfaction and happiness.","city":"Redwood City","state":"California","country":"United States","url":"https://www.joveo.com/careers","date":"2019-11-24","text":null,"valid":true},{"referencenumber":8,"company":"Joveo","category":"Support","department":null,"title":"Senior Product Manager","description":"Manage end-to-end product design and development lifecycle: from research, concept formation, development, launch and validation.","city":"London","state":"London","country":"United Kingdom","url":"https://www.joveo.com/careers","date":"2019-05-15","text":"s","valid":true},{"referencenumber":9,"company":"Joveo","category":"Support","department":null,"title":"DIGITAL MARKETING MANAGER","description":"Grow new leads and support their journey through all stages of the marketing and sales funnels","city":"Redwood City","state":"California","country":"United States","url":"https://www.joveo.com/careers","date":"2019-05-15","text":"s","valid":true},{"referencenumber":10,"company":"Joveo","category":"Support","department":null,"title":"HR MANAGER","description":"Create a process and manage employee on-boarding, assimilation program for US employees","city":"Redwood City","state":"California","country":"United States","url":"https://www.joveo.com/careers","date":"2019-05-20","text":null,"valid":true}]